# Пользователь вводит число. Определить количество 
# цифр в этом числе, посчитать их сумму и среднее арифметическое. 
# Определить количество нулей в этом числе. 
# Общение с пользователем организовать через меню.
count = 0
sum = 0
number = input ('enter number:')
a = int (len(number))

print ('можу порахувати кількість цифр: введи 1')
print ('можу порахувати сумму цифр: введи 2')
print ('можу порахувати середнє арифметичне: введи 3')
print ('можу порахувати кількість нулів: введи 4')
choise = int (input('вводь тут:'))

for i in number:
    if i == '0':
        count += 1
    else: # '0'<= i >= '9':
        sum += int (i) 
c = sum / a #середнє арифметичне

if choise == 1:
    print ('кількість цифр = ',a)
elif choise == 2:
    print ('сума цифр = ',sum)
elif choise == 3:
    print ('середнє арифметичне = ',c)
elif choise == 4:
    print ('кількість нулів = ',count)