# Написать программу, которая выводит на экран 
# шахматную доску с заданным размером клеточки. Например, три,
# ***---***---***---***---
# ***---***---***---***---
# ***---***---***---***---
# ---***---***---***---***
# ---***---***---***---***
# ---***---***---***---***

n = int (input ('enter number:'))
for i in range(n): #рядок
    for j in range(n): #висота рядка
        for k in range(n): #стовбчик
            for m in range(n):#ширина клітинки
                if (i+k) % 2 == 0:
                    print('*',end='')
                else:
                    print('-',end='')
        print()
      
