# Написать программу, которая проверяет пользователя на знание таблицы умножения. 
# Программа выводит на экран два числа, пользователь должен ввести их произведение.
# Разработать несколько уровней сложности (отличаются сложностью и количеством вопросов). 
# Вывести пользователю оценку его знаний.


import random
a = random.randint (1,9)
b = random.randint (1,9)
while True:
    print ()