# Пользователь вводит с клавиатуры строку. Произведите поворот строк 
# и полученный результат выведите на экран.

string = input ('enter string:')
print (string[::-1])
