# Напишите функцию, которая отображает на экран
# форматированный текст, указанный ниже:
# “Don't let the noise of others' opinions
# drown out your own inner voice.”
#                              Steve Jobs

def text():
    print ('“Don\'t let the noise of others\' opinions\n drown out your own inner voice.\n \t\t\t\t Steve Jobs”')

text()