# Лабораторна робота №2.
# Наслідування
# Ціль. Отримати практичні навички створення ієрархії класів та використання статичних
# компонентів класу.
# Основний зміст роботи.
# Написати програму, де створюється ієрархія класів.
# Порядок виконання.
# 1.Визначити ієрархію класів (відповідно до варіанта).
# 2.Реалізувати класи.
# 3.Написати демонстраційну програму, у якій створюються об'єкти різних класів.
# Методичні вказівки.
# 1.Для визначення ієрархії класів пов'язати наслідуванням класи, наведені у додатку (для
# заданого варіанта). З перерахованих класів вибрати один, який стоятиме на чолі ієрархії. Це
# абстрактний клас.
# 2. Визначення класів, їх реалізацію, демонстраційну програму помістити в окремі файли.
# (повинно бути не менше 5 файлів)
# Варіанти завдань.
# Список класів.
# 1 . студент, викладач, особа, зав. кафедрою
# 2. службовець, особа, робітник, інженер
# 3. робітник, кадри, інженер, адміністрація
# 4. деталь, механізм, виріб, вузол
# 5. організація, страхова компанія, суднобудівна компанія, завод
# 6. журнал, книга, друковане видання, підручник
# 7. тест, іспит, випускний іспит, випробування
# 8. місце, область, місто, мегаполіс
# 9. іграшка, продукт, товар, молочний продукт
# 10. квитанція, накладна, документ, чек_____________________________________________________________my
# 11. автомобіль, поїзд, транспортний засіб, експрес
# 12. двигун, двигун внутрішнього згоряння, дизель, турбореактивний двигун
# 13. республіка, монархія, королівство, держава
# 14. ссавці, парнокопитні, птиці, тварина
# 15. корабель, пароплав, вітрильник, корвет


