# Пользователь вводит любое целое число. Необходимо из этого целого числа удалить все цифры 3 и 6 и 
# вывести обратно на экран.


x = int (input ('enter x='))

for i in range (x):
    
        print (i, end = ' ')