# Запрограммируйте класс Money (объект класса оперирует одной валютой) для работы с деньгами.
# В классе должны быть предусмотрены поле для хранения целой части денег (доллары, евро, гривны и т.д.) и 
# поле для хранения копеек (центы, евроценты, копейки 
# и т.д.).
# Реализовать методы для вывода суммы на экран, задания значений для частей

class Money():
    def __init__(self,hrivna,copiyci) -> None:
        self.hrivna = hrivna
        self.copiyci = copiyci
        return (self.hrivna),(self.copiyci)
