# Напишите функцию, вычисляющую сумму элементов списка целых. Список передается вкачестве параметра.
from random import random

number = int (input('enter quatity number for audit:'))
lst0 = []
for i in range (number):
    lst0.append(random())
sum_numbers = sum(lst0)
print (lst0)

def sum_numbers():
    return sum_numbers
print (sum_numbers)
