# Пользователь вводит с клавиатуры длину линии и 
# символ для заполнения линии. Нужно отобразить на 
# экране вертикальную линию из введенного символа, 
# указанной длины. 
# Например, если было введено 5 и символ %, тогда 
# вывод на экран будет такой:
#                         %
#                         %
#                         %
#                         %
#                         %

a = int(input ('enter start cycle:'))
b = input ('enter symbol:')

for i in range (a):
    print (b)

